tap "aws/tap"
tap "dagger/tap"
tap "drone/drone"
tap "hashicorp/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "redis-stack/redis-stack"
brew "act"
brew "python@3.11"
brew "ansible"
brew "giflib"
brew "libpng"
brew "jpeg-xl"
brew "aom"
brew "python@3.8"
brew "aws-sam-cli"
brew "docutils"
brew "awscli"
brew "bat"
brew "glib"
brew "pkg-config"
brew "cairo"
brew "cloc"
brew "curl"
brew "libavif"
brew "gd"
brew "php"
brew "composer"
brew "coreutils"
brew "ctop"
brew "dive"
brew "entr"
brew "fd"
brew "unbound"
brew "gnutls"
brew "harfbuzz"
brew "leptonica"
brew "libass"
brew "pango"
brew "tesseract"
brew "ffmpeg"
brew "gcc"
brew "gdk-pixbuf"
brew "geos"
brew "gh"
brew "git-gui"
brew "go"
brew "gobject-introspection"
brew "guile"
brew "handbrake", link: false
brew "hdf5"
brew "htop"
brew "shared-mime-info"
brew "libheif"
brew "imagemagick"
brew "jpeg", link: true
brew "jq"
brew "jsonnet"
brew "jsonnet-bundler"
brew "k3d"
brew "k6"
brew "kind"
brew "kubernetes-cli"
brew "kustomize"
brew "libgsf"
brew "libmatio"
brew "librsvg"
brew "luv"
brew "mage"
brew "tree-sitter"
brew "neovim"
brew "nmap"
brew "node"
brew "node@16"
brew "openjdk@11"
brew "openslide"
brew "poppler"
brew "pyenv"
brew "python@3.10"
brew "python@3.9"
brew "ruby-build"
brew "rbenv"
brew "redis"
brew "ripgrep"
brew "shellcheck"
brew "speedtest-cli"
brew "sshpass"
brew "tanka"
brew "terraform"
brew "tflint"
brew "the_silver_searcher"
brew "tilt"
brew "tldr"
brew "tree"
brew "vips"
brew "wget"
brew "yarn"
brew "youtube-dl"
brew "dagger/tap/dagger"
brew "hashicorp/tap/terraform-ls"
brew "heroku/brew/heroku"
cask "1password"
cask "alfred"
cask "cyberduck"
cask "dbeaver-community"
cask "discord"
cask "docker"
cask "evernote"
cask "google-chrome"
cask "handbrake"
cask "insomnia"
cask "microsoft-remote-desktop"
cask "rectangle"
cask "redis-stack-redisinsight"
cask "signal"
cask "slack"
cask "spotify"
cask "tuple"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"
vscode "asvetliakov.vscode-neovim"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "grapecity.gc-excelviewer"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vsliveshare.vsliveshare"
vscode "pomdtr.excalidraw-editor"
vscode "vue.volar"
