tap "aws/tap"
tap "dagger/tap"
tap "drone/drone"
tap "go-task/tap"
tap "hashicorp/tap"
tap "heroku/brew"
tap "homebrew/bundle"
brew "ansible"
brew "aws-sam-cli"
brew "docutils"
brew "awscli"
brew "bat"
brew "curl"
brew "composer"
brew "coreutils"
brew "ctop"
brew "dive"
brew "entr"
brew "fd"
brew "gnutls"
brew "ffmpeg"
brew "git-gui"
brew "go"
brew "pkg-config"
brew "handbrake", link: false
brew "htop"
brew "libheif"
brew "imagemagick"
brew "jq"
brew "jsonnet"
brew "jsonnet-bundler"
brew "k3d"
brew "k6"
brew "kind"
brew "kubernetes-cli"
brew "kustomize"
brew "libgsf"
brew "libmatio"
brew "librsvg"
brew "luarocks"
brew "luv"
brew "mage"
brew "tree-sitter"
brew "neovim"
brew "nmap"
brew "node"
brew "openslide"
brew "pyenv"
brew "ruby-build"
brew "ripgrep"
brew "rust"
brew "shellcheck"
brew "speedtest-cli"
brew "tanka"
brew "terraform"
brew "tflint"
brew "tilt"
brew "tldr"

# ── Tmux ───────────────────────────────────────────────────────────────────────
# bash - macOS ships with bash 3.2; tokyo-night-tmux requires bash 4.2+
# bc   - required by tokyo-night-tmux for netspeed/git widgets
# fzf  - fuzzy finder; used for tmux session picker popup
# lazygit - terminal UI for git; faster than gitk on large repos
brew "bash"
brew "bc"
brew "fzf"
brew "lazygit"
cask "font-jetbrains-mono-nerd-font" # Nerd Font v3+ required by tokyo-night-tmux
brew "tree"
brew "vips"
brew "wget"
brew "yarn"
brew "dagger/tap/dagger"
brew "go-task/tap/go-task"
brew "hashicorp/tap/terraform-ls"
brew "heroku/brew/heroku"
cask "1password"
cask "alfred"
cask "brave-browser"
cask "cyberduck"
cask "discord"
cask "docker"
cask "google-chrome"
cask "handbrake"
cask "insomnia"
cask "rectangle"
cask "signal"
cask "slack"
cask "spotify"
cask "tableplus"
cask "tuple"
cask "visual-studio-code"
cask "vlc"
vscode "asvetliakov.vscode-neovim"
vscode "golang.go"
vscode "grapecity.gc-excelviewer"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vsliveshare.vsliveshare"
vscode "pomdtr.excalidraw-editor"
vscode "vue.volar"
