tap "aws/tap"
tap "dagger/tap"
tap "drone/drone"
tap "go-task/tap"
tap "hashicorp/tap"
tap "heroku/brew"
tap "homebrew/bundle"

# ── Core ────────────────────────────────────────────────────────────────────────
brew "git"
brew "gh"
brew "curl"
brew "wget"
brew "coreutils"
brew "bat"
brew "fd"
brew "ripgrep"
brew "jq"
brew "tree"
brew "tldr"
brew "entr"
brew "shellcheck"
brew "gnupg"
brew "bd"                         # cd up to a named parent dir (e.g. bd src)

# ── Shell ────────────────────────────────────────────────────────────────────────
brew "ansible"
brew "azure-cli"

# ── Tmux ────────────────────────────────────────────────────────────────────────
# bash    - macOS ships with bash 3.2; tokyo-night-tmux requires bash 4.2+
# bc      - required by tokyo-night-tmux for netspeed/git widgets
# fzf     - fuzzy finder; used for tmux session picker popup
# lazygit - terminal UI for git; faster than gitk on large repos
brew "tmux"
brew "bash"
brew "bc"
brew "fzf"
brew "lazygit"
cask "font-jetbrains-mono-nerd-font" # Nerd Font v3+ required by tokyo-night-tmux

# ── Neovim ──────────────────────────────────────────────────────────────────────
brew "neovim"
brew "luarocks"
brew "luv"
brew "tree-sitter"

# ── Languages & Runtimes ────────────────────────────────────────────────────────
brew "go"
brew "node"
brew "node@18"
brew "node@22"
brew "yarn"
brew "rust"
brew "mise"
brew "pkgconf"

# ── Cloud & Infrastructure ──────────────────────────────────────────────────────
brew "awscli"
brew "aws-sam-cli"
brew "docutils"                   # aws-sam-cli dep
brew "terraform"
brew "tflint"
brew "tanka"
brew "jsonnet-bundler"
brew "go-jsonnet"
brew "kustomize"
brew "k3d"
brew "k6"
brew "kind"
brew "kubernetes-cli"
brew "k9s"
brew "kubectx"
brew "mage"
brew "dagger/tap/dagger"
brew "go-task/tap/go-task"
brew "hashicorp/tap/terraform-ls"
brew "heroku/brew/heroku"
brew "tilt"

# ── Media & Images ──────────────────────────────────────────────────────────────
brew "ffmpeg"
brew "imagemagick"
brew "vips"
brew "libheif"
brew "libgsf"
brew "libmatio"
brew "librsvg"
brew "openslide"
brew "handbrake", link: false
brew "gnutls"

# ── Dev Tools ───────────────────────────────────────────────────────────────────
brew "git-gui"
brew "htop"
brew "ctop"
brew "dive"
brew "nmap"
brew "speedtest-cli"

# ── Casks ───────────────────────────────────────────────────────────────────────
cask "1password"
cask "brave-browser"
cask "1password-cli"
cask "alfred"
cask "claude-code"
cask "cyberduck"
cask "dbeaver-community"
cask "discord"
cask "docker"
cask "orbstack"
cask "ghostty"
cask "google-chrome"
cask "handbrake"
cask "meetingbar"
cask "obsidian"
cask "pearcleaner"
cask "rectangle"
cask "sequel-ace"
cask "signal"
cask "slack"
cask "spotify"
cask "jordanbaird-ice"
cask "tuple"
